===
Empty Document
===

@startuml
@enduml

---

(source_file (document))

===
Comment
===

@startuml
' this is a comment
@enduml

---

(source_file (document
  (comment)
))

===
Actor
===

@startuml
participant foo
@enduml

---

(source_file (document
  (participant (identifier))
))

===
Actor with alias
===

@startuml
participant foo as "bar"
@enduml

---

(source_file (document
  (participant (identifier) (keyword) (string))
))

===
skinparam
===

@startuml
skinparam backgroundColor transparent
@enduml

---

(source_file (document
  (skinparam
    (identifier)
    (string)
)))
